var zoffy = [
    ["ゾフィー", 7, 5, 6, 4, "UR", "2-001", "dd830c", "M87光線", "f9ce1d"],
    ["ゾフィー", 7, 4, 5, 4, "OR", "3-005", "dd830c", "ウルトラフロスト", "ff5252"],
    ["ゾフィー", 7, 4, 5, 4, "O", "T-029", "dd830c", "M87光線", "f9ce1d"]
];
var man = [
    ["ウルトラマン", 6, 6, 5, 5, "UR", "1-001", "0000cc", "スペシウム光線", "f9ce1d"],
    ["ウルトラマン", 6, 5, 4, 5, "UR", "2-008", "0000cc", "ウルトラエアキャッチ", "f9ce1d"],
    ["ウルトラマン", 7, 4, 4, 5, "OR", "3-006", "0000cc", "ウルトラスラッシュ", "5ed361"],
    ["ウルトラマン", 7, 5, 4, 4, "O", "T-001", "0000cc", "スペシウム光線", "f9ce1d"],
    ["ウルトラマン", 6, 5, 5, 4, "O", "P-001", "0000cc", "ウルトラスラッシュ", "5ed361"],
    ["ウルトラマン", 6, 5, 4, 5, "O", "P-005", "0000cc", "ウルトラスラッシュ", "5ed361"]
];
var seven = [
    ["セブン", 6, 5, 6, 5, "UR", "2-002", "2196f3", "エメリウム光線", "f9ce1d"],
    ["セブン", 6, 5, 5, 4, "OR", "4-006", "2196f3", "ワイドショット", "f9ce1d"],
    ["セブン", 5, 5, 5, 5, "O", "T-035", "2196f3", "エメリウム光線", "f9ce1d"]
];
var jack = [
    ["ジャック", 5, 6, 5, 6, "UR", "1-002", "286f2c", "ウルトラスパーク", "5ed361"],
    ["ジャック", 4, 5, 5, 6, "OR", "2-009", "286f2c", "ウルトラランス", "f9ce1d"],
    ["ジャック", 5, 4, 4, 7, "OR", "3-007", "286f2c", "流星キック", "5ed361"],
    ["ジャック", 4, 6, 6, 6, "O", "T-023", "286f2c", "ウルトラスパーク", "5ed361"]
];
var ace = [
    ["エース", 5, 5, 7, 5, "UR", "1-003", "2196f3", "メタリウム光線", "f9ce1d"],
    ["エース", 5, 5, 6, 4, "OR", "4-007", "2196f3", "バーチカルギロチン", "ff5252"],
    ["エース", 5, 4, 7, 4, "O", "T-036", "2196f3", "メタリウム光線", "f9ce1d"]
];
var taro = [
    ["タロウ", 5, 9, 5, 5, "UR", "1-003", "ff0000", "ストリウム光線", "f9ce1d"],
    ["タロウ", 5, 8, 5, 4, "OR", "2-010", "ff0000", "スワローキック", "5ed361"],
    ["タロウ", 4, 8, 6, 4, "OR", "3-008", "ff0000", "ウルトラダイナマイト", "ff5252"],
    ["タロウ", 5, 8, 5, 4, "O", "T-003", "ff0000", "ストリウム光線", "f9ce1d"]
];
var leo = [
    ["レオ", 4, 8, 7, 5, "UR", "2-004", "ff0000", "レオキック", "5ed361"],
    ["レオ", 4, 7, 6, 5, "OR", "3-009", "ff0000", "ハンドスライサー", "ff5252"],
    ["レオ", 4, 7, 7, 4, "O", "T-030", "ff0000", "レオキック", "5ed361"]
];
var tiga = [
    ["ティガ", 6, 6, 5, 5, "UR", "1-004", "dd830c", "ゼペリオン光線", "f9ce1d"],
    ["ティガ", 6, 4, 5, 5, "OR", "2-011", "dd830c", "タイマーフラッシュスペシャル", "f9ce1d"],
    ["ティガ", 6, 5, 4, 5, "OR", "3-010", "dd830c", "ティガスライサー", "5ed361"],
    ["ティガ", 7, 5, 4, 4, "O", "T-002", "dd830c", "ゼペリオン光線", "f9ce1d"],
    ["ティガ", 6, 5, 5, 4, "O", "P-002", "dd830c", "ゼペリオン光線", "f9ce1d"]
];
var tigasky = [
    ["ティガ（スカイ）", 4, 4, 5, 7, "OR", "1-005", "0000cc", "ランバルト光弾", "f9ce1d"],
    ["ティガ（スカイ）", 5, 4, 4, 7, "O", "T-005", "0000cc", "ランバルト光弾", "f9ce1d"]
];
var tigapow = [
    ["ティガ（パワー）", 6, 5, 7, 4, "UR", "4-002", "ff0000", "デラシウム光流", "ff5252"]
];
var dyna = [
    ["ダイナ", 5, 6, 7, 4, "UR", "2-005", "0000cc", "ソルジェント光線", "f9ce1d"],
    ["ダイナ", 5, 5, 6, 4, "OR", "3-011", "0000cc", "ダイナスラッシュ", "5ed361"],
    ["ダイナ", 4, 5, 6, 4, "O", "T-024", "0000cc", "ソルジェント光線", "f9ce1d"]
];
var dynamira = [
    ["ダイナ（ミラクル）", 5, 5, 4, 6, "OR", "2-006", "0000cc", "レボリウムウェーブ", "f9ce1d"]
];
var dynastro = [
    ["ダイナ（ストロング）", 7, 5, 6, 4, "UR", "4-003", "ff0000", "ガルネイトボンバー シューティングバージョン", "f9ce1d"]
];
var gaiaV2 = [
    ["ガイア（V2）", 4, 8, 4, 5, "OR", "1-006", "dd830c", "フォトンエッジ", "ff5252"],
    ["ガイア（V2）", 5, 7, 5, 5, "UR", "4-004", "dd830c", "ガイアブリザード", "ff5252"],
    ["ガイア（V2）", 6, 7, 5, 4, "O", "T-037", "dd830c", "フォトンエッジ", "ff5252"]
];
var agul = [
    ["アグル", 5, 4, 5, 6, "O", "T-038", "2196f3", "フォトンクラッシャー", "ff5252"]
];
var agulV2 = [
    ["アグル（V2）", 5, 5, 5, 7, "UR", "3-002", "2196f3", "フォトンクラッシャー", "ff5252"]
];
var cosmos = [
    ["コスモス", 3, 5, 6, 6, "OR", "1-007", "2196f3", "フルムーンレクト", "5ed361"],
    ["コスモス", 5, 6, 6, 5, "UR", "4-005", "2196f3", "ムーンライトスマッシュ", "f9ce1d"],
    ["コスモス", 4, 5, 4, 7, "O", "T-025", "2196f3", "ルナエキストラクト", "f9ce1d"],
    ["コスモス", 4, 5, 5, 6, "O", "P-004", "2196f3", "フルムーンレクト", "5ed361"]
];
var nexusred = [
    ["ネクサス（ジュネッス）", 6, 5, 6, 5, "UR", "3-003", "0000cc", "オーバーレイ・シュトローム", "f9ce1d"],
    ["ネクサス（ジュネッス）", 5, 5, 5, 5, "OR", "4-008", "0000cc", "ボードレイフェザー", "5ed361"]
];
var max = [
    ["マックス", 4, 5, 4, 7, "OR", "1-008", "0000cc", "マクシウムカノン", "f9ce1d"],
    ["マックス", 5, 5, 4, 6, "OR", "2-012", "0000cc", "ギャラクシーカノン", "f9ce1d"],
    ["マックス", 4, 5, 4, 7, "O", "T-031", "0000cc", "マクシウムソード", "f9ce1d"]
];
var mebius = [
    ["メビウス", 5, 6, 5, 6, "UR", "1-009", "666666", "メビュームシュート", "f9ce1d"],
    ["メビウス", 4, 5, 5, 6, "OR", "2-013", "666666", "メビュームダイナマイト", "ff5252"],
    ["メビウス", 5, 4, 4, 7, "UR", "3-012", "666666", "メビュームブレード", "5ed361"],
    ["メビウス", 5, 5, 4, 6, "O", "T-004", "666666", "メビュームシュート", "f9ce1d"]
];
var hikari = [
    ["ヒカリ", 5, 5, 6, 6, "UR", "3-004", "dd830c", "ナイトシュート", "f9ce1d"],
    ["ヒカリ", 5, 4, 5, 6, "O", "T-016", "dd830c", "ナイトシュート", "f9ce1d"]
];
var zero = [
    ["ゼロ", 6, 6, 5, 5, "UR", "1-010", "2196f3", "ワイドゼロショット", "f9ce1d"],
    ["ゼロ", 5, 5, 5, 5, "OR", "2-014", "2196f3", "ゼロスラッガー", "5ed361"],
    ["ゼロ", 5, 5, 6, 4, "OR", "3-013", "2196f3", "ゼロツインシュート", "f9ce1d"],
    ["ゼロ", 5, 5, 6, 4, "OR", "4-009", "2196f3", "ワイドゼロショット", "f9ce1d"],
    ["ゼロ", 6, 5, 5, 4, "O", "T-026", "2196f3", "ワイドゼロショット", "f9ce1d"],
    ["ゼロ", 6, 5, 4, 5, "O", "P-006", "2196f3", "ゼロツインシュート", "f9ce1d"],
    ["ゼロ", 5, 5, 6, 4, "O", "P-009", "2196f3", "ゼロツインシュート", "f9ce1d"]
];
var belial = [
    ["ベリアル", 6, 5, 7, 4, "UR", "2-007", "cc00cc", "デスシウム光線", "f9ce1d"],
    ["ベリアル", 4, 5, 7, 4, "OR", "3-014", "cc00cc", "ベリアルジェノサンダー", "ff5252"],
    ["ベリアル", 5, 4, 7, 4, "O", "T-032", "cc00cc", "デスシウム光線", "f9ce1d"]
];
var ginga = [
    ["ギンガ", 6, 4, 4, 6, "OR", "1-011", "0000cc", "ギンガサンダーボルト", "f9ce1d"],
    ["ギンガ", 6, 4, 5, 5, "O", "T-017", "0000cc", "ギンガクロスシュート", "f9ce1d"],
    ["ギンガ", 7, 4, 5, 4, "O", "P-008", "0000cc", "ギンガクロスシュート", "f9ce1d"]
];
var victory = [
    ["ビクトリー", 5, 4, 5, 6, "OR", "1-012", "dd830c", "ビクトリウムシュート", "f9ce1d"],
    ["ビクトリー", 5, 4, 6, 5, "O", "T-018", "dd830c", "ビクトリウムシュート", "f9ce1d"]
];
var x = [
    ["エックス", 5, 5, 5, 5, "OR", "1-013", "dd830c", "ザナディウム光線", "f9ce1d"],
    ["エックス", 6, 5, 4, 5, "O", "T-019", "dd830c", "アタッカーX", "ff5252"],
    ["エックス", 6, 5, 5, 4, "O", "P-003", "dd830c", "ザナディウム光線", "f9ce1d"],
    ["エックス", 5, 5, 6, 4, "O", "P-007", "dd830c", "アタッカーX", "ff5252"]
];
var tigas = tiga.concat(tigasky, tigapow);
var aguls = agul.concat(agulV2);
var card = [zoffy, man, seven, jack, ace, taro, leo, tiga, tigasky, tigapow, dyna, dynamira, dynastro, gaiaV2, agul, agulV2, cosmos, nexusred, max, mebius, hikari, zero, belial, ginga, victory, x, tigas, aguls];
