menuItem = [
    ["光の力、お借りします！"],
    ["個別に選ぶ？", "2-001", "3-005", "6-006", "T-029"],//ゾフィー
    ["個別に選ぶ？", "1-001", "2-008", "3-006", "T-001", "P-001", "P-005"],//マン
    ["個別に選ぶ？", "2-002", "4-006", "6-007",  "T-035"],//セブン
    ["個別に選ぶ？", "1-002", "2-009", "3-007", "T-023"],//ジャック
    ["個別に選ぶ？", "2-003", "4-007", "T-036"],//エース
    ["個別に選ぶ？", "1-003", "2-010", "3-008", "6-008", "T-003"],//タロウ
    ["個別に選ぶ？", "2-004", "3-009", "T-030"],//レオ
    ["個別に選ぶ？", "1-004", "2-011", "3-010", "T-002", "P-002"],//ティガ
    ["個別に選ぶ？", "1-005", "6-002", "T-005"],//ティガスカイ
    ["個別に選ぶ？", "4-002", "T-058"],//ティガパワー
    ["個別に選ぶ？", "2-005", "3-011", "T-024"],//ダイナ
    ["個別に選ぶ？", "2-006", "6-003"],//ダイナミラクル
    ["個別に選ぶ？", "4-003", "T-059"],//ダイナパワー
    ["個別に選ぶ？", "1-006", "4-004", "T-037"],//ガイアV2
    ["個別に選ぶ？", "T-038"],//アグル
    ["個別に選ぶ？", "3-002", "5-006"],//アグルV2
    ["個別に選ぶ？", "1-007", "4-005", "T-025", "P-004"],//コスモス
    ["個別に選ぶ？", "6-004", "T-057"],//ジャスティスクラッシャー
    ["個別に選ぶ？", "3-003", "4-008"],//ネクサス
    ["個別に選ぶ？", "1-008", "2-012", "6-005", "T-031"],//マックス
    ["個別に選ぶ？", "1-009", "2-013", "3-012", "5-007", "T-004"],//メビウス
    ["個別に選ぶ？", "3-004", "6-009", "T-016"],//ヒカリ
    ["個別に選ぶ？", "1-010", "2-014", "3-013", "4-009", "T-026", "P-006", "P-009"],//ゼロ
    ["個別に選ぶ？", "5-001", "6-010", "T-056"],//ウルティメイトゼロ
    ["個別に選ぶ？", "2-007", "3-014", "5-008", "T-032"],//ベリアル
    ["個別に選ぶ？", "1-011", "5-002", "T-017", "P-008"],//ギンガ
    ["個別に選ぶ？", "1-012", "5-003", "T-018"],//ビクトリー
    ["個別に選ぶ？", "1-013", "5-004", "T-019", "P-003", "P-007"]//エックス
];

function setMenuItem(n) {
    itemNum = menuItem[n].length;
    document.myForm.Computer.options.length = 0;
    for (i = 0; i < itemNum; i++)
        document.myForm.Computer.options[i] = new Option(menuItem[n][i], menuItem[n][i]);
}
